
{
  "posts": [
    {
      "p_img": "tmc",
      "username": "Thane Traffic Department",
      "time": "2024-11-11 08:05",
      "city": "Thane",
      "localaddress": "Ghodbunder Road",
      "zip": 400615,
      "latitude": 19.300231,
      "longitude": 72.972004,
      "title": "Accident Near Patlipada Junction",
      "body": "Earlier today, a minor accident occurred at Patlipada Junction involving a two-wheeler and a car. While no serious injuries were reported, the mishap has led to significant traffic buildup along Ghodbunder Road, particularly during peak hours. Commuters are advised to take alternate routes such as the Hiranandani Estate road or the internal Majiwada route. Traffic authorities are on-site managing the situation, and clearance is expected within the next 2 hours.",
      "createdBy": "official"
      },
    {
      "p_img": "userfb",
      "username": "Ananya_M",
      "time": "2024-11-11 09:15",
      "city": "Mumbai",
      "localaddress": "Andheri West",
      "zip": 400053,
      "latitude": 19.1197,
      "longitude": 72.8469,
      "title": "Signal Malfunction at Infiniti Mall",
      "body": "The traffic signal near Infiniti Mall in Andheri West has been out of service since early this morning, resulting in chaotic traffic conditions. Both vehicular and pedestrian traffic are heavily affected, causing delays for those commuting to work and school. Local authorities have been informed, and technicians are currently working on restoring the signal. In the meantime, traffic police are manually directing the vehicles. The issue is expected to be resolved by noon, but delays may persist in the area for a while longer.",
      "createdBy": "self",
      "liked": false
    },
    {
      "p_img": "userma",
      "username": "Vikas_P",
      "time": "2024-11-11 07:50",
      "city": "Thane",
      "localaddress": "Vartak Nagar",
      "zip": 400606,
      "latitude": 19.19956,
      "longitude": 72.967856,
      "title": "Waterlogging Near Vartak Nagar",
      "body": "Due to continuous heavy rainfall since last night, significant waterlogging has been reported near Vartak Nagar. This has led to severe slowdowns and traffic diversions on key routes such as the LBS Marg and Pokhran Road. Commuters traveling towards Thane Station are particularly affected. Authorities have dispatched water pumps to clear the flooded areas, but it may take a few hours before the situation improves. Commuters are strongly advised to avoid this area if possible and take the Eastern Express Highway as an alternative.",
      "createdBy": "unofficial",
      "liked": true
    },
    {
      "p_img": "bmc",
      "username": "Mumbai Traffic Department",
      "time": "2024-11-11 10:20",
      "city": "Mumbai",
      "localaddress": "Bandra Kurla Complex",
      "zip": 400051,
      "latitude": 19.058645,
      "longitude": 72.870471,
      "title": "Overcrowding Near BKC",
      "body": "An ongoing corporate event at Bandra Kurla Complex has led to massive traffic congestion in the surrounding areas, including the Western Express Highway and the SCLR. Traffic police are present at all key intersections, but the sheer volume of vehicles is making it difficult to manage. Employees working in BKC are reporting delays of up to an hour to reach their offices. Traffic conditions are expected to normalize only after 3 PM when the event concludes.",
      "createdBy": "official"
    },
    {
      "p_img": "usermb",
      "username": "Ramesh_T",
      "time": "2024-11-11 06:40",
      "city": "Thane",
      "localaddress": "Naupada",
      "zip": 400602,
      "latitude": 19.186096,
      "longitude": 72.970899,
      "title": "Road Repair Work in Naupada",
      "body": "The municipal corporation has initiated road repair work in the Naupada area early this morning, which has led to a significant slowdown in traffic movement. Residents and office-goers commuting through the region are experiencing delays of up to 45 minutes. Authorities have set up barricades, narrowing the usable road space. The repair work is expected to continue throughout the day, and normal traffic flow is anticipated to resume only by late evening. Commuters are advised to take alternate routes such as Gokhale Road.",
      "createdBy": "self",
      "liked": true
    },
    {
      "p_img": "usermd",
      "username": "Sanjay_M",
      "time": "2024-11-11 09:30",
      "city": "Mumbai",
      "localaddress": "Chembur",
      "zip": 400071,
      "latitude": 19.062345,
      "longitude": 72.900764,
      "title": "Fire Incident at Chembur Market",
      "body": "A minor fire broke out at Chembur Market early this morning, leading to panic among vendors and customers. Fire brigades have managed to bring the fire under control, but traffic has been heavily affected due to onlookers crowding the streets and emergency vehicles blocking certain lanes. Authorities are requesting residents to avoid the area as cleanup operations continue. Normal traffic flow is expected to resume by late afternoon.",
      "createdBy": "unofficial",
      "liked": true
    },
    {
      "p_img": "userme",
      "username": "Deepak_P",
      "time": "2024-11-11 07:45",
      "city": "Thane",
      "localaddress": "Manpada",
      "zip": 400607,
      "latitude": 19.212389,
      "longitude": 72.976287,
      "title": "Signal Malfunction at Manpada Circle",
      "body": "A signal malfunction at the busy Manpada Circle has resulted in severe traffic snarls during the morning rush hour. Traffic police are on-site, manually directing vehicles, but delays of up to 30 minutes are being reported. The malfunction is expected to be resolved by 10 AM, but commuters are advised to plan their routes accordingly to avoid congestion.",
      "createdBy": "self",
      "liked": false
    },
    {
      "p_img": "usermc",
      "username": "Karan_S",
      "time": "2024-11-11 08:15",
      "city": "Mumbai",
      "localaddress": "Dahisar East",
      "zip": 400068,
      "latitude": 19.25192,
      "longitude": 72.85976,
      "title": "Broken Water Pipeline on Western Express Highway",
      "body": "A broken water pipeline near Dahisar East on the Western Express Highway has caused partial flooding, leading to severe traffic congestion in the area. Authorities have been notified and repair work is underway. Traffic is being diverted through local roads, causing delays of up to 45 minutes. Normal traffic flow is expected to resume by the evening.",
      "createdBy": "unofficial",
      "liked": true
    },
    {
      "p_img": "userfa",
      "username": "Sneha_T",
      "time": "2024-11-11 06:55",
      "city": "Thane",
      "localaddress": "Kalwa Naka",
      "zip": 400605,
      "latitude": 19.19577,
      "longitude": 72.985624,
      "title": "Ongoing Repairs at Kalwa Bridge",
      "body": "Routine maintenance work on the Kalwa Bridge has led to restricted vehicle movement. Only one lane is operational, resulting in long queues during peak hours. Heavy vehicles are being rerouted to ease the congestion. The work is expected to conclude by 6 PM, after which normal traffic conditions will resume.",
      "createdBy": "unofficial",
      "liked": false
    },
    {
      "p_img": "usermc",
      "username": "Ravi_p",
      "time": "2024-11-11 10:10",
      "city": "Mumbai",
      "localaddress": "Jogeshwari East",
      "zip": 400060,
      "latitude": 19.135983,
      "longitude": 72.859475,
      "title": "Construction Work at JVLR",
      "body": "Ongoing metro construction work on JVLR near Jogeshwari East is causing traffic bottlenecks, especially during office hours. Traffic police have implemented diversions, but delays are still being reported. Commuters are advised to avoid JVLR and instead use the Western Express Highway or internal Andheri roads. Work is expected to continue for the next few days.",
      "createdBy": "unofficial",
      "liked": true
    },
    {
      "p_img": "tmc",
      "username": "Thane Traffic Department",
      "time": "2024-11-11 08:30",
      "city": "Thane",
      "localaddress": "Mulund Check Naka",
      "zip": 400080,
      "latitude": 19.16904,
      "longitude": 72.94392,
      "title": "Overloaded Trucks Causing Delays",
      "body": "Several overloaded trucks at Mulund Check Naka have slowed down traffic movement. The authorities are conducting vehicle checks, leading to long queues. Light vehicles are being given priority, but delays of up to 20 minutes are still being reported. Commuters are advised to plan their travel accordingly.",
      "createdBy": "official"
    },
    {
      "p_img": "usermf",
      "username": "Amit_J",
      "time": "2024-11-11 09:50",
      "city": "Mumbai",
      "localaddress": "Sion Circle",
      "zip": 400022,
      "latitude": 19.04261,
      "longitude": 72.8656,
      "title": "Traffic Due to Protest at Sion",
      "body": "A group of protestors has gathered at Sion Circle, causing major traffic disruptions. Police are negotiating with the protestors to clear the area, but commuters are advised to avoid this route and take alternate roads like the Eastern Express Highway. Traffic is expected to normalize by noon.",
      "createdBy": "unofficial",
      "liked": false
    },
    {
      "p_img": "userme",
      "username": "Deepak_P",
      "time": "2024-11-11 07:20",
      "city": "Thane",
      "localaddress": "Bhiwandi Bypass",
      "zip": 421302,
      "latitude": 19.28127,
      "longitude": 73.04757,
      "title": "Roadblock on Bhiwandi Bypass",
      "body": "Heavy vehicle breakdowns on the Bhiwandi Bypass have resulted in significant delays for both light and heavy vehicles. Authorities are working to clear the road, but traffic congestion is expected to last for the next 3-4 hours. Commuters are strongly advised to avoid this route during the morning peak.",
      "createdBy": "self",
      "liked": true
    },
    {
      "p_img": "bmc",
      "username": "Mumbai Traffic Department",
      "time": "2024-11-11 08:45",
      "city": "Mumbai",
      "localaddress": "Marine Drive",
      "zip": 400020,
      "latitude": 18.94321,
      "longitude": 72.82398,
      "title": "Parade at Marine Drive",
      "body": "A scheduled parade at Marine Drive is drawing large crowds, leading to traffic congestion in the area. Traffic police are present and have cordoned off certain sections of the road. Delays are expected until the event concludes around 1 PM. Commuters heading towards Churchgate or Nariman Point are advised to use alternate routes.",
      "createdBy": "official"
    },
    {
      "p_img": "userfa",
      "username": "Nikita_S",
      "time": "2024-11-11 10:05",
      "city": "Thane",
      "localaddress": "Hiranandani Meadows",
      "zip": 400610,
      "latitude": 19.20312,
      "longitude": 72.97845,
      "title": "Congestion at Hiranandani Roundabout",
      "body": "The Hiranandani Meadows roundabout is experiencing heavy traffic due to school buses and morning commuters. Authorities have deployed additional personnel to manage traffic, but delays of up to 25 minutes are being reported. Normal traffic flow is expected after 11:30 AM.",
      "createdBy": "unofficial",
      "liked": true
    },
    {
      "p_img": "userfb",
      "username": "Sunita_V",
      "time": "2024-11-11 07:10",
      "city": "Thane",
      "localaddress": "Majiwada",
      "zip": 400601,
      "latitude": 19.20956,
      "longitude": 72.963,
      "title": "Heavy Traffic Due to Festival Procession",
      "body": "A religious procession passing through Majiwada is causing significant delays. The procession started early in the morning and is expected to continue until noon. Key routes such as Ghodbunder Road and the service lanes towards Eastern Express Highway are severely affected. Traffic police are on-site managing the flow, but commuters are advised to avoid the area during this time.",
      "createdBy": "unofficial",
      "liked": true
    },
    {
      "p_img": "usermf",
      "username": "Rahul_C",
      "time": "2024-11-11 06:35",
      "city": "Mumbai",
      "localaddress": "Borivali West",
      "zip": 400091,
      "latitude": 19.229246,
      "longitude": 72.854727,
      "title": "Signal Down at Chandavarkar Road",
      "body": "The traffic signal at Chandavarkar Road in Borivali West is currently not operational, leading to confusion among drivers and long queues during peak hours. Local traffic authorities are manually directing vehicles to ease congestion. Repairs are underway, and normal operations are expected to resume by noon.",
      "createdBy": "unofficial",
      "liked": false
    },
    {
      "p_img": "userfc",
      "username": "Pooja_S",
      "time": "2024-11-11 09:00",
      "city": "Thane",
      "localaddress": "Kopri",
      "zip": 400603,
      "latitude": 19.189751,
      "longitude": 72.975672,
      "title": "Traffic Jam Near Kopri Bridge",
      "body": "The Kopri Bridge area is facing heavy traffic due to ongoing maintenance work. Commuters traveling towards Thane Station are experiencing delays of up to 30 minutes. Authorities have put up diversions, but congestion is likely to persist until late evening. Alternate routes via LBS Marg or Eastern Express Highway are recommended.",
      "createdBy": "unofficial",
      "liked": true
    },
    {
      "p_img": "bmc",
      "username": "Mumbai Traffic Department",
      "time": "2024-11-11 08:20",
      "city": "Mumbai",
      "localaddress": "Ghatkopar East",
      "zip": 400077,
      "latitude": 19.08653,
      "longitude": 72.909182,
      "title": "Waterlogging at Ghatkopar Metro Station",
      "body": "Heavy overnight rains have caused waterlogging near Ghatkopar Metro Station, disrupting both vehicular and pedestrian traffic. Commuters heading towards Eastern Express Highway are particularly affected. Authorities are working to drain the water, but it could take a few hours before conditions improve. It is advised to avoid this area if possible.",
      "createdBy": "official"
    },
    {
      "p_img": "tmc",
      "username": "Thane Traffic Department",
      "time": "2024-11-11 09:45",
      "city": "Thane",
      "localaddress": "Balkum",
      "zip": 400608,
      "latitude": 19.2048,
      "longitude": 72.9671,
      "title": "Traffic Diversion Due to VIP Movement",
      "body": "Due to the arrival of a VIP delegation, traffic around Balkum has been diverted, leading to congestion on nearby routes such as the Thane-Bhiwandi Road. Heavy police presence is ensuring minimal disruption, but delays of up to 20 minutes are still being reported. Traffic conditions are expected to return to normal by afternoon.",
      "createdBy": "official"
    },
    {
      "p_img": "userma",
      "username": "Arjun_K",
      "time": "2024-11-11 06:50",
      "city": "Mumbai",
      "localaddress": "Powai",
      "zip": 400076,
      "latitude": 19.117643,
      "longitude": 72.906718,
      "title": "Accident Near Powai Lake",
      "body": "A minor accident occurred near Powai Lake involving a private car and a rickshaw. While no serious injuries have been reported, the incident has led to slow-moving traffic on the Jogeshwari-Vikhroli Link Road (JVLR). Police are clearing the vehicles, and normal traffic is expected to resume shortly. Commuters are advised to be cautious when traveling through this area.",
      "createdBy": "unofficial",
      "liked": true
    },
    {
      "p_img": "tmc",
      "username": "Thane Traffic Department",
      "time": "2024-11-11 10:25",
      "city": "Thane",
      "localaddress": "Kasarvadavali",
      "zip": 400615,
      "latitude": 19.26851,
      "longitude": 72.96778,
      "title": "Market Rush Near Hypercity Mall",
      "body": "Heavy rush at Hypercity Mall has caused slow-moving traffic along Ghodbunder Road. This is due to ongoing festive sales attracting a large number of shoppers. Parking lots are full, and vehicles are being diverted to alternate parking spaces. Traffic is expected to normalize by late evening.",
      "createdBy": "official"
    },
    {
      "p_img": "bmc",
      "username": "Mumbai Traffic Department",
      "time": "2024-11-11 07:40",
      "city": "Mumbai",
      "localaddress": "Malad East",
      "zip": 400097,
      "latitude": 19.18289,
      "longitude": 72.85257,
      "title": "Congestion at Malad Subway",
      "body": "Malad Subway is experiencing heavy traffic due to waterlogging from overnight rains. Traffic police are on-site, and pumps have been deployed to clear the water. Until the situation improves, commuters are advised to use the Goregaon or Kandivali flyovers as alternative routes.",
      "createdBy": "official"
    },
    {
      "p_img": "usermc",
      "username": "Nisha_J",
      "time": "2024-11-11 09:10",
      "city": "Thane",
      "localaddress": "Shilphata",
      "zip": 400612,
      "latitude": 19.16789,
      "longitude": 73.0708,
      "title": "Road Repair Causing Delays",
      "body": "Ongoing repair work at Shilphata junction has led to significant traffic congestion. The work, aimed at widening the road to ease future traffic, is causing delays of up to 45 minutes for vehicles traveling towards Navi Mumbai and Dombivli. Authorities are advising commuters to plan for additional travel time.",
      "createdBy": "unofficial",
      "liked": true
    },
    {
      "p_img": "usermb",
      "username": "Varun_R",
      "time": "2024-11-11 06:25",
      "city": "Mumbai",
      "localaddress": "Parel",
      "zip": 400012,
      "latitude": 18.99243,
      "longitude": 72.83632,
      "title": "Slow Traffic Near Tata Memorial Hospital",
      "body": "Due to ongoing road construction, traffic near Tata Memorial Hospital in Parel is moving at a snail's pace. Patients and visitors are experiencing delays, and emergency vehicles are finding it difficult to navigate. Traffic is expected to improve after 1 PM once the construction team clears some sections.",
      "createdBy": "unofficial",
      "liked": false
    }
  ]
}
